---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor
source: html/98b2130e-ab7c-2c43-97de-d1e125ba6b7e.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor Method

Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.

## Syntax (C#)
```csharp
public ExternalResourceSubFolder()
```